# Algoritm 
# 1. Задать пользователю вопрос об имени 
# 2. Получить и запомнить (сохранить)
# 3. Создать строку приветствия 
# 4. Добавить в неё полученное имя
# 5. Вывести приветсвие с именем на экран 
# Вопрос пользователю: input('Текст вопроса') 
input('Как тебя зовут?')    
# answer = input('Как тебя зовут')  
    print('Как тебя зовут'+'Михаил')
    print('минимум')
    