# Варианты стоимости
hour = int(60)
week = int(300)
month = int(1000)
year = int(2000)

# Задать вопрос о годе рождения
age = print('Какой у вас год рождения ?')
age = int(age)

# Вычислить возраст
Возраст = 2025 - age 

coeef = 0.5
if возраст >= 14 and возраст <= 24:
    print('студент')
coeef = 0
elif возраст < 14 or > 50:
    print('Бесплтано')
coeef = 1
else возраст > 14 and < 50:
# Указать тариф
tariff = input('На какой срок нужен проездной ?'('Час, неделя, месяц, год')
               